app/views/products/index.html.haml

SELECT `products`.* FROM `products`
---
= react_component("Purchaser", {products: Product.all})